espruino/Espruino/targets/stm32/jshardware.c
bool jshIsUSBSERIALConnected() {
#ifdef USB
  return SysTickUSBWatchdog < SYSTICKS_BEFORE_USB_DISCONNECT;
  // not a check for connected - we just want to have some idea...
#else
  return false;
#endif
}

static inline unsigned int getSystemTimerFreq() {
  return SystemCoreClock;
}

JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
  return (JsSysTime)((ms*getSystemTimerFreq())/1000);
}

JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
  return ((JsVarFloat)time)*1000/getSystemTimerFreq();
}


JsSysTime jshGetSystemTime() {
  JsSysTime major1, major2, major3, major4;
  unsigned int minor;
  do {
    major1 = SysTickMajor;
    major2 = SysTickMajor;
    minor = SysTick->VAL;
    major3 = SysTickMajor;
    major4 = SysTickMajor;
  } while (major1!=major2 || major2!=major3 || major3!=major4);
  return major1 - (JsSysTime)minor;
}

// ----------------------------------------------------------------------------

bool jshPinInput(Pin pin) {
  bool value = false;
  if (jshIsPinValid(pin)) {
    if (!jshGetPinStateIsManual(pin)) 
      jshPinSetState(pin, JSHPINSTATE_GPIO_IN);

    value = jshPinGetValue(pin);
  } else jsError("Invalid pin!");
  return value;
}

JsVarFloat jshPinAnalog(Pin pin) {
  JsVarFloat value = 0;
  if (pin >= JSH_PIN_COUNT /* inc PIN_UNDEFINED */ || pinInfo[pin].analog==JSH_ANALOG_NONE) {
    jshPrintCapablePins(pin, "Analog Input", 0,0,0,0, true);
    return 0;
  }

  ADC_TypeDef *ADCx = stmADC(pin);
  bool needs_init = false;
  if (pinInfo[pin].analog & JSH_ANALOG1) {
    static bool inited = false;
    if (!inited) {
      inited = true;
      needs_init = true;
      #if defined(STM32F3)
        RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC12, ENABLE);
      #elif defined(STM32F4)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
      #else
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
      #endif
    }
  } else if (pinInfo[pin].analog & JSH_ANALOG2) {
    static bool inited = false;
    if (!inited) {
      inited = true;
      needs_init = true;
      #if defined(STM32F3)
        RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC12, ENABLE);
      #elif defined(STM32F4)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);
      #else
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);
      #endif
    }
  } else if (pinInfo[pin].analog & JSH_ANALOG3) {
    static bool inited = false;
    if (!inited) {
      inited = true;
      needs_init = true;
      #if defined(STM32F3)
        RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC34, ENABLE);
      #elif defined(STM32F4)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, ENABLE);
      #else
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, ENABLE);
      #endif
    }
#if ADCS>3
  } else if (pinInfo[pin].analog & JSH_ANALOG4) {
    static bool inited = false;
    if (!inited) {
      inited = true;
      needs_init = true;
      #if defined(STM32F3)
        RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC34, ENABLE);
      #elif defined(STM32F4)
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC4, ENABLE);
      #else
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC4, ENABLE);
      #endif
    }
#endif
  } else {
    jsErrorInternal("couldn't find ADC!");
    return -1;
  }

  if (needs_init) {
#ifdef STM32F3
    ADC_CommonInitTypeDef ADC_CommonInitStructure;
    ADC_CommonStructInit(&ADC_CommonInitStructure);
    ADC_CommonInitStructure.ADC_Mode          = ADC_Mode_Independent;
    ADC_CommonInitStructure.ADC_Clock         = ADC_Clock_SynClkModeDiv2;
    ADC_CommonInitStructure.ADC_DMAAccessMode     = ADC_DMAAccessMode_Disabled;
    ADC_CommonInitStructure.ADC_TwoSamplingDelay          = ADC_SampleTime_1Cycles5;
    ADC_CommonInit(ADCx, &ADC_CommonInitStructure);
#endif

    // ADC Structure Initialization
    ADC_InitTypeDef ADC_InitStructure;
    ADC_StructInit(&ADC_InitStructure);
    // Preinit
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
  #ifndef STM32F3
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  #if defined(STM32F2) || defined(STM32F4)
    ADC_InitStructure.ADC_ExternalTrigConvEdge        = ADC_ExternalTrigConvEdge_None;
  #else
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
  #endif
  #endif
    ADC_Init(ADCx, &ADC_InitStructure);

    // Enable the ADC
    ADC_Cmd(ADCx, ENABLE);

  #ifdef STM32API2
    // No calibration??
  #else
    // Calibrate
    ADC_ResetCalibration(ADCx);
    while(ADC_GetResetCalibrationStatus(ADCx));
    ADC_StartCalibration(ADCx);
    while(ADC_GetCalibrationStatus(ADCx));
  #endif
  }
  jshSetPinStateIsManual(pin, false);
  jshPinSetState(pin, JSHPINSTATE_ADC_IN);
  // Configure channel

#if defined(STM32F2) || defined(STM32F4)
  uint8_t sampleTime = ADC_SampleTime_480Cycles;
#elif defined(STM32F3) 
  uint8_t sampleTime = ADC_SampleTime_601Cycles5;
#else
  uint8_t sampleTime = ADC_SampleTime_239Cycles5/*ADC_SampleTime_55Cycles5*/;
#endif
  ADC_RegularChannelConfig(ADCx, stmADCChannel(pin), 1, sampleTime);

  // Start the conversion
#if defined(STM32F2) || defined(STM32F4)
  ADC_SoftwareStartConv(ADCx);
#elif defined(STM32F3)
  ADC_StartConversion(ADCx);
#else
  ADC_SoftwareStartConvCmd(ADCx, ENABLE);
#endif

  // Wait until conversion completion


  WAIT_UNTIL(ADC_GetFlagStatus(ADCx, ADC_FLAG_EOC) != RESET, "ADC");

  // Get the conversion value
  value = ADC_GetConversionValue(ADCx) / (JsVarFloat)65535;
  return value;
}

void jshPinOutput(Pin pin, bool value) {
  if (jshIsPinValid(pin)) {
    if (!jshGetPinStateIsManual(pin)) 
      jshPinSetState(pin, JSHPINSTATE_GPIO_OUT);
    jshPinSetValue(pin, value);
  } else jsError("Invalid pin!");
}

void jshPinAnalogOutput(Pin pin, JsVarFloat value, JsVarFloat freq) { // if freq<=0, the default is used
  if (value<0) value=0;
  if (value>1) value=1;
  JshPinFunction func = 0;
  if (jshIsPinValid(pin)) {
    int i;
    for (i=0;i<JSH_PININFO_FUNCTIONS;i++) {
      if (freq<=0 && JSH_PINFUNCTION_IS_DAC(pinInfo[pin].functions[i])) {
        // note: we don't use DAC if a frequency is specified
        func = pinInfo[pin].functions[i];
      }
      if (func==0 && JSH_PINFUNCTION_IS_TIMER(pinInfo[pin].functions[i])) {
        func = pinInfo[pin].functions[i];
      }
    }
  }

  if (!func) {
    jshPrintCapablePins(pin, "PWM Output", JSH_TIMER1, JSH_TIMERMAX, 0,0, false);
    jsiConsolePrint("\nOr pins with DAC output are:\n");
    jshPrintCapablePins(pin, 0, JSH_DAC, JSH_DAC, 0,0, false);
    jsiConsolePrint("\n");
    return;
  }

  if (JSH_PINFUNCTION_IS_DAC(func)) {
#if defined(DACS) && DACS>0
    // Special case for DAC output
    uint16_t data = (uint16_t)(value*0xFFFF);
    if ((func & JSH_MASK_INFO)==JSH_DAC_CH1) {
      static bool initialised = false;
      if (!initialised) {
        initialised = true;
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
        DAC_InitTypeDef  DAC_InitStructure;
        DAC_StructInit(&DAC_InitStructure);
        DAC_Init(DAC_Channel_1, &DAC_InitStructure);
        DAC_Cmd(DAC_Channel_1, ENABLE);
        jshSetPinStateIsManual(pin, false);
        jshPinSetState(pin, JSHPINSTATE_DAC_OUT);
      }
      DAC_SetChannel1Data(DAC_Align_12b_L, data);
    } else if ((func & JSH_MASK_INFO)==JSH_DAC_CH2) {
      static bool initialised = false;
      if (!initialised) {
        initialised = true;
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
        DAC_InitTypeDef  DAC_InitStructure;
        DAC_StructInit(&DAC_InitStructure);
        DAC_Init(DAC_Channel_2, &DAC_InitStructure);
        DAC_Cmd(DAC_Channel_2, ENABLE);
        jshSetPinStateIsManual(pin, false);
        jshPinSetState(pin, JSHPINSTATE_DAC_OUT);
      }
      DAC_SetChannel2Data(DAC_Align_12b_L, data);
    } else
#endif
      jsErrorInternal("Unknown DAC");
    return;
  }

