espruino/Espruino/targets/stm32/jshardware.c
  if (FLASH_MAGIC != *(unsigned int*)FLASH_MAGIC_LOCATION) {
    jsiConsolePrint("\nFlash Magic Byte is wrong");
    errors++;
  }

  if (errors) {
      jsiConsolePrintf("\nThere were %d errors!\n>", errors);
  } else
      jsiConsolePrint("\nDone!\n>");

//  This is nicer, but also broken!
//  FLASH_UnlockBank1();
//  /* Clear All pending flags */
//  FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
//
//  size_t varDataSize = jsvGetVarDataSize();
//  int *basePtr = jsvGetVarDataPointer();
//
//  int page;
//  for(page=0;page<FLASH_PAGES;page++) {
//    jsPrint("Flashing Page ");jsPrintInt(page);jsPrint("...\n");
//    size_t pageOffset = (FLASH_PAGE_SIZE * page);
//    size_t pagePtr = FLASH_START + pageOffset;
//    size_t pageSize = varDataSize-pageOffset;
//    if (pageSize>FLASH_PAGE_SIZE) pageSize = FLASH_PAGE_SIZE;
//    jsPrint("Offset ");jsPrintInt(pageOffset);jsPrint(", Size ");jsPrintInt(pageSize);jsPrint(" bytes\n");
//    bool first = true;
//    int errors = 0;
//    int i;
//    for (i=pageOffset;i<pageOffset+pageSize;i+=4)
//      if ((*(int*)(FLASH_START+i)) != basePtr[i>>2])
//        errors++;
//    while (errors && !jspIsInterrupted()) {
//      if (!first) { jsPrintInt(errors);jsPrint(" errors - retrying...\n"); }
//      first = false;
//      /* Erase the FLASH page */
//      FLASH_ErasePage(pagePtr);
//      /* Program Flash Bank1 */
//      for (i=pageOffset;i<pageOffset+pageSize;i+=4)
//          FLASH_ProgramWord(FLASH_START+i, basePtr[i>>2]);
//      FLASH_WaitForLastOperation(0x20000);
//    }
//  }
//  // finally flash magic byte
//  FLASH_ProgramWord(FLASH_MAGIC_LOCATION, FLASH_MAGIC);
//  FLASH_WaitForLastOperation(0x20000);
//  FLASH_LockBank1();
//  if (*(int*)FLASH_MAGIC_LOCATION != FLASH_MAGIC)
//    jsPrint("Flash magic word not flashed correctly!\n");
//  jsPrint("Flashing Complete\n");

}

void jshLoadFromFlash() {
  unsigned int dataSize = jsvGetMemoryTotal() * sizeof(JsVar);
  jsiConsolePrintf("\nLoading %d  bytes from flash...", dataSize);

  JsVar *firstData = jsvLock(1);
  uint32_t *basePtr = (uint32_t *)firstData;
  jsvUnLock(firstData);

  memcpy(basePtr, (int*)FLASH_START, dataSize);
  jsiConsolePrint(" Done!\n>");
}

bool jshFlashContainsCode() {
  /*jsPrint("Magic contains ");
  jsPrintInt(*(int*)FLASH_MAGIC_LOCATION);
  jsPrint("we want");
  jsPrintInt(FLASH_MAGIC);
  jsPrint("\n");*/
  return (*(int*)FLASH_MAGIC_LOCATION) == (int)FLASH_MAGIC;
}

extern void SetSysClock(void);

/// Enter simple sleep mode (can be woken up by interrupts)
void jshSleep() {

/*#ifdef ESPRUINOBOARD
  // This code gets power consumption down to 6.5mA on idle - from 15mA
  while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET) { } // HACK - wait for USART1
  // Switch to HSI
  RCC_HSICmd(ENABLE);
  while(RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET);   
  RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI); 
  while(RCC_GetSYSCLKSource() !=  0x00);
  RCC_PLLCmd ( DISABLE ) ;
  RCC_HSEConfig(RCC_HSE_OFF);
  // set peripherals for new clock rates
  SystemCoreClockUpdate();
  JshUSARTInfo inf;
  jshUSARTInitInfo(&inf);
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf);
#endif*/

#ifdef ESPRUINOBOARD
  if (allowDeepSleep && !jsiHasTimers() && !jshHasTransmitData()) {
    // deep sleep!
    ADC_Cmd(ADC1, DISABLE); // ADC off
    ADC_Cmd(ADC2, DISABLE); // ADC off
    ADC_Cmd(ADC3, DISABLE); // ADC off
#ifdef USB
    //PowerOff(); // USB disconnect - brings us down to 0.12mA - but seems to lock Espruino up afterwards!
#endif

    /* Add EXTI for Serial port */
    //jshPinWatch(JSH_PORTA_OFFSET+10, true);
    /* add exti for USB */
    // USB has 15k pull-down resistors (and STM32 has 40k pull up)
    Pin usbPin = JSH_PORTA_OFFSET+11;
    Pin oldWatch = watchedPins[pinInfo[usbPin].pin];
    jshPinWatch(usbPin, true);
    // -----------------------------------------------
    /* Request to enter STOP mode with regulator in low power mode*/
    PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);
    // -----------------------------------------------
    // remove watches on pins
    jshPinWatch(usbPin, false);
    if (oldWatch!=PIN_UNDEFINED) jshPinWatch(oldWatch, true);
    // recover oscillator
    RCC_HSEConfig(RCC_HSE_ON);
    if( RCC_WaitForHSEStartUp() == SUCCESS) {
      RCC_PLLCmd(ENABLE);
      while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);
      RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
      while(RCC_GetSYSCLKSource() != 0x08);
    }
#ifdef USB
    //PowerOn(); // USB on
#endif
    //allowDeepSleep = false;
  } else
#endif
  __WFI(); // Wait for Interrupt

/*#ifdef ESPRUINOBOARD
  // recover...
  RCC_HSEConfig ( RCC_HSE_ON ) ;
  while(RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET);
  RCC_PLLCmd ( ENABLE ) ;
  while ( RCC_GetFlagStatus ( RCC_FLAG_PLLRDY ) == RESET ) ;
  RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
  while(RCC_GetSYSCLKSource() != 0x08);
  RCC_HSICmd(DISABLE);
  // re-initialise peripherals
  SystemCoreClockUpdate();
  jshUSARTInitInfo(&inf);
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf);
#endif*/
}

typedef enum {
  UT_NONE,
  UT_PULSE_ON,
  UT_PULSE_OFF,
  UT_PIN_SET_RELOAD_EVENT,
  UT_PIN_SET,
} PACKED_FLAGS UtilTimerType;

#define UTILTIMERTASK_PIN_COUNT (4)
typedef struct UtilTimerTask {
  JsSysTime time; // time at which to set pins
  Pin pins[UTILTIMERTASK_PIN_COUNT]; // pins to set
  uint8_t value; // value to set pins to
} PACKED_FLAGS UtilTimerTask;

#define UTILTIMERTASK_TASKS (64) // MUST BE POWER OF 2
UtilTimerTask utilTimerTasks[UTILTIMERTASK_TASKS];
volatile unsigned char utilTimerTasksHead = 0;
volatile unsigned char utilTimerTasksTail = 0;


volatile UtilTimerType utilTimerType = UT_NONE;
unsigned int utilTimerBit;
bool utilTimerState;
unsigned int utilTimerData;
uint16_t utilTimerReload0H, utilTimerReload0L, utilTimerReload1H, utilTimerReload1L;
Pin utilTimerPin;

void _utilTimerDisable() {
  utilTimerType = UT_NONE;
  TIM_Cmd(UTIL_TIMER, DISABLE);
}

void _utilTimerEnable(uint16_t prescale, uint16_t initialPeriod) {
  if (utilTimerType != UT_PIN_SET) {
    jshSetPinStateIsManual(utilTimerPin, false);
    jshPinSetState(utilTimerPin, JSHPINSTATE_GPIO_OUT);
  }

  /* TIM6 Periph clock enable */
  RCC_APB1PeriphClockCmd(UTIL_TIMER_APB1, ENABLE);


  /*Timer configuration------------------------------------------------*/
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, DISABLE);
  TIM_Cmd(UTIL_TIMER, DISABLE);
 // TIM_ARRPreloadConfig(UTIL_TIMER, FALSE); // disable auto buffering 'period' register
// TIM_UpdateRequestConfig(UTIL_TIMER, TIM_UpdateSource_Regular); // JUST underflow/overflow

  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
  TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
  TIM_TimeBaseInitStruct.TIM_Prescaler = prescale;
  TIM_TimeBaseInitStruct.TIM_Period = initialPeriod;
  TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);

  //TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, ENABLE);
  TIM_Cmd(UTIL_TIMER, ENABLE);  /* enable counter */
}

