espruino/Espruino/targets/stm32/jshardware.c
unsigned int getUtilTimerFreq() {
  // HCLK_Frequency * APB1 prescaler * (APB1 prescaler=1)?1:2;
  // PCLK1_Frequency * (APB1 prescaler=1)?1:2;
  // TODO FIXME WRONG for VL board -= hard coding this is nasty. See jshInit
#ifdef STM32VLDISCOVERY
  return SystemCoreClock;
#else
  return SystemCoreClock / 4;
#endif
}


void _utilTimerSetPinStateAndReload() {
  if (utilTimerType == UT_PIN_SET_RELOAD_EVENT) {
    // in order to set this timer, we must have set the arr register, fired the timer irq, and then waited for the next!
    utilTimerType = UT_PIN_SET;
  } else if (utilTimerType == UT_PULSE_ON) {
    utilTimerType = UT_PULSE_OFF;
    jshPinSetValue(utilTimerPin, utilTimerState);
  } else if (utilTimerType == UT_PULSE_OFF) {
    jshPinSetValue(utilTimerPin, !utilTimerState);
     _utilTimerDisable();
  /*} else if (utilTimerType == UT_PIN_SET_INITIAL_HACK) {
    utilTimerType = UT_PIN_SET;*/
  } else if (utilTimerType == UT_PIN_SET) {
    //jshPinSetValue(LED4_PININDEX,1);
    JsSysTime time = jshGetSystemTime();
    // execute any timers that are due
    while (utilTimerTasksTail!=utilTimerTasksHead && utilTimerTasks[utilTimerTasksTail].time<time) {
      UtilTimerTask *task = &utilTimerTasks[utilTimerTasksTail];
      int j;
      for (j=0;j<UTILTIMERTASK_PIN_COUNT;j++) {
        if (task->pins[j] == PIN_UNDEFINED) break;
        jshPinSetValue(task->pins[j], (task->value >> j)&1);
      }          
      utilTimerTasksTail = (utilTimerTasksTail+1) & (UTILTIMERTASK_TASKS-1);
    }

    // re-schedule the timer if there is something left to do
    if (utilTimerTasksTail != utilTimerTasksHead) {
      utilTimerType = UT_PIN_SET_RELOAD_EVENT;
      unsigned int timerFreq = getUtilTimerFreq();
      int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-time)) / getSystemTimerFreq());
      if (clockTicks<0) clockTicks=0;
      int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
      if (prescale>65535) prescale=65535;
      int ticks = (uint16_t)(clockTicks/(prescale+1));
      if (ticks<1) ticks=1;
      if (ticks>65535) ticks=65535;
      TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
      TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
      TIM_TimeBaseInitStruct.TIM_Prescaler = (uint16_t)prescale;
      TIM_TimeBaseInitStruct.TIM_Period = (uint16_t)ticks;
      TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);
    } else {
      _utilTimerDisable();
    }
    //jshPinSetValue(LED4_PININDEX,0);
  } else {
    // What the??
    _utilTimerDisable();
  }

}

/// Called when the timer is fired
void UTIL_TIMER_IRQHandler(void) {
  // clear interrupt flag
  if (TIM_GetITStatus(UTIL_TIMER, TIM_IT_Update) != RESET) {
    TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
    // handle
    _utilTimerSetPinStateAndReload();
  }
}

void _utilTimerWait() {
  WAIT_UNTIL(utilTimerType == UT_NONE, "Utility Timer");
}

void jshPinPulse(Pin pin, bool pulsePolarity, JsVarFloat pulseTime) {
  // ---- SOFTWARE PULSE
  /* JsSysTime ticks = jshGetTimeFromMilliseconds(time);
 //jsPrintInt(ticks);jsPrint("\n");
  if (jshIsPinValid(pin) {
    jshPinSetState(pin, JSHPINSTATE_GPIO_OUT);
    jshPinSetValue(pin, value);
    JsSysTime starttime = jshGetSystemTime();
    JsSysTime endtime = starttime + ticks;
    //jsPrint("----------- ");jsPrintInt(endtime>>16);jsPrint("\n");
    JsSysTime stime = jshGetSystemTime();
    while (stime>=starttime && stime<endtime && !jspIsInterrupted()) { // this stops rollover issue
      stime = jshGetSystemTime();
      //jsPrintInt(stime>>16);jsPrint("\n");
    }
    jshPinSetValue(pin, !value);
  } else jsError("Invalid pin!"); */
  // ---- USE TIMER FOR PULSE
  if (!jshIsPinValid(pin)) {
       jsError("Invalid pin!");
       return;
  }
  _utilTimerWait();

  unsigned int timerFreq = getUtilTimerFreq();
  int clockTicks = (int)(((JsVarFloat)timerFreq * pulseTime) / 1000);
  int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to

  uint16_t ticks = (uint16_t)(clockTicks/(prescale+1));

  /*jsiConsolePrintInt(SystemCoreClock);jsiConsolePrint(",");
  jsiConsolePrintInt(ticks);jsiConsolePrint(",");
  jsiConsolePrintInt(prescale);jsiConsolePrint("\n");*/

  utilTimerType = UT_PULSE_ON;
  utilTimerState = pulsePolarity;
  utilTimerPin = pin;


  _utilTimerEnable((uint16_t)prescale, ticks);
}

bool jshPinOutputAtTime(JsSysTime time, Pin pin, bool value) {
  unsigned char nextHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);
  if (nextHead == utilTimerTasksTail) { 
/*    JsSysTime t = jshGetSystemTime();
    jsiConsolePrint("Timer Queue full\n");
    while (nextHead!=utilTimerTasksHead) {
      jsiConsolePrint("Task ");
      jsiConsolePrintInt(utilTimerTasks[nextHead].value);
      jsiConsolePrint(" at ");
      char buf[32];
      ftoa(jshGetMillisecondsFromTime(utilTimerTasks[nextHead].time-t)/1000, buf);
      jsiConsolePrint(buf);
      jsiConsolePrint("s\n");
      nextHead = (nextHead+1) & (UTILTIMERTASK_TASKS-1);
    }*/

    return false;
  }

  jshInterruptOff();  
  int insertPos = utilTimerTasksTail;
  // find out where to insert
  while (insertPos != utilTimerTasksHead && utilTimerTasks[insertPos].time < time)
    insertPos = (insertPos+1) & (UTILTIMERTASK_TASKS-1);

  if (utilTimerTasks[insertPos].time==time && utilTimerTasks[insertPos].pins[UTILTIMERTASK_PIN_COUNT-1]==PIN_UNDEFINED) {
    // TODO: can we modify the call to jshPinOutputAtTime to do this without the seek with interrupts disabled?
    // if the time is correct, and there is a free pin...
    int i;
    for (i=0;i<UTILTIMERTASK_PIN_COUNT;i++)
      if (utilTimerTasks[insertPos].pins[i]==PIN_UNDEFINED) {
        utilTimerTasks[insertPos].pins[i] = pin;
        if (value) 
          utilTimerTasks[insertPos].value = utilTimerTasks[insertPos].value | (uint8_t)(1 << i);
        else
          utilTimerTasks[insertPos].value = utilTimerTasks[insertPos].value & (uint8_t)~(1 << i);
        break; // all done
      }
  } else {
    bool haveChangedTimer = insertPos==utilTimerTasksTail;
    //jsiConsolePrint("Insert at ");jsiConsolePrintInt(insertPos);jsiConsolePrint(", Tail is ");jsiConsolePrintInt(utilTimerTasksTail);jsiConsolePrint("\n");
    // shift items forward
    int i = utilTimerTasksHead;
    while (i != insertPos) {
      unsigned char next = (i+UTILTIMERTASK_TASKS-1) & (UTILTIMERTASK_TASKS-1);
      utilTimerTasks[i] = utilTimerTasks[next];
      i = next;
    }
    // add new item
    utilTimerTasks[insertPos].time = time;
    //jsiConsolePrint("Time is ");jsiConsolePrintInt(utilTimerTasks[insertPos].time);jsiConsolePrint("\n");
    utilTimerTasks[insertPos].pins[0] = pin;
    for (i=1;i<UTILTIMERTASK_PIN_COUNT;i++)
      utilTimerTasks[insertPos].pins[i] = PIN_UNDEFINED;
    utilTimerTasks[insertPos].value = value?0xFF:0;
    utilTimerTasksHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);
    //jsiConsolePrint("Head is ");jsiConsolePrintInt(utilTimerTasksHead);jsiConsolePrint("\n");
    // now set up timer if not already set up...
    if (utilTimerType != UT_PIN_SET || haveChangedTimer) {
      //jsiConsolePrint("Starting\n");
      unsigned int timerFreq = getUtilTimerFreq();
      int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-jshGetSystemTime())) / getSystemTimerFreq());
      if (clockTicks<0) clockTicks=0;
      int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
      int ticks = (uint16_t)(clockTicks/(prescale+1));
      if (ticks<1) ticks=1;
      if (ticks>65535) ticks=65535;
      utilTimerType = UT_PIN_SET_RELOAD_EVENT;
      _utilTimerEnable((uint16_t)prescale, (uint16_t)ticks);
      //jsiConsolePrintInt(utilTimerType);jsiConsolePrint("\n");
    }
  }
  jshInterruptOn();
  return true;
}

// timer enabled  p *(unsigned int *)0x40001400
// timer period  p *(unsigned int *)0x4000142C
